{"workshopId":2426240254,"Title":"Fyrefly's Emergency Recoilers","Description":"To die, some say, is to become one with Qud. An ending that begets more beginnings than one can fathom. Only through death, they oft continue, can the world exhale and begin preparations for its next breath.\r\n\r\nThe Eaters were, however, not particularly keen on this philosophy. Arguing that their intellect self-evidently granted them an exception to this otherwise universal rule, they set out to rescue themselves from any potential demise. Building on the now-ubiquitous recoiler, the Eaters devised a machine that could detect death, along with similar conditions, and immediately trigger a recoil-effect whilst, simultaneously, pumping their wielder with enough healing serum to revive a salt kraken.\r\n\r\nThere is a reason, unfortunately, that recoilers need time to activate, as indeed performing such a transition between spatial frames requires such an immense amount of energy which, when released in only a single moment, causes the emergency recoiler to all but evaporate.\r\n\r\nThus, today, few Emergency Recoilers remain within the harsh borders of Qud, and of those, most are bound to ruins long since abandoned, presenting the wielder with the distinct possibility of perishing to a superior foe, only to immediately find themselves countless parsangs away from home, deep in the dangerous wilderness - perhaps, in some cases, it may have been better to have simply died in the first place.\r\n\r\n[hr][/hr]\r\n[h1]FEATURES:[/h1]\r\n[list]\r\n[*][b]Random-Point Recoilers[/b] [Rare]: If equipped and powered, fully heals and teleports the user instantly upon death to a random unique location in Qud.\r\n[*][b]Fixed-Point Recoilers[/b] [Very Rare]: Like Random-Point Recoilers, but targeting a (usually safe) preset destination such as Joppa, Grit Gate or the Six Day Stilt.\r\n[*][b]Local-Point Recoilers[/b] [Extremely Rare]: Like Random-Point Recoilers, but targeting a random point within your current zone.\r\n[/list]\r\n\r\n[hr][/hr]\r\n[h1]Further Notes:[/h1]\r\nA single random-point emergency recoiler can be found on the [url=https://cavesofqud.gamepedia.com/Ancient_bones] ancient bones[/url] beneath Joppa.\r\n\r\nBeyond that, they have been added to a number of loot tables - I have done a decent amount of my own testing but I haven't played through many proper runs through with it, so any balance notes/opinions are very much welcome and I may well be adjusting their rates with feedback - these are powerful items, but I hope to have made them rare enough to avoid having the mod feel like cheating. \r\n\r\nThe code for this can be found at [url=https://github.com/TomCassWindred/QudEmergencyRecoiler] github [/url], please feel free to look at it, comment on it, ask it on a date, pull-request it, fork it or bathe it tenderly under the soft moonlight of a midsummer night.","Tags":"Item,Artifact,Tool,Script,Balance","Visibility":"2","ImagePath":"preview.png"}